In [5]:
# import data from csv into pandas

import pandas as pd
data = pd.read_csv('us-counties.csv')
data.head()

         date     county       state     fips  cases  deaths
0  2020-01-21  Snohomish  Washington  53061.0      1     0.0
1  2020-01-22  Snohomish  Washington  53061.0      1     0.0
2  2020-01-23  Snohomish  Washington  53061.0      1     0.0
3  2020-01-24       Cook    Illinois  17031.0      1     0.0
4  2020-01-24  Snohomish  Washington  53061.0      1     0.0

In [7]:
# tuple of dimensions of the data

data.shape

(959462, 6)

In [10]:
# data types of columns

data.dtypes

date       object
county     object
state      object
fips      float64
cases       int64
deaths    float64
dtype: object

In [22]:
print(type(data['date']))
print(type(data['county']))
print(type(data['state']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In pandas, string or series will appear as objects

In [23]:
# the number of non-null value in the dataset

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 959462 entries, 0 to 959461
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    959462 non-null  object
 1   county  959462 non-null  object
 2   state   959462 non-null  object
 3   fips    950524 non-null  float64
 4   cases   959462 non-null  int64
 5   deaths  938907 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 43.9+ MB

In [24]:
# the number of unique value in each of the column

data.nunique()

date        369
county     1930
state        55
fips       3218
cases     33974
deaths     3720
dtype: int64

In [25]:
# returns useful descriptive statistics for each column of data

data.describe()

                fips         cases         deaths
count  950524.000000  9.594620e+05  938907.000000
mean    31276.956274  2.346632e+03      58.774370
std     16302.239265  1.239449e+04     466.317292
min      1001.000000  0.000000e+00       0.000000
25%     19001.000000  4.300000e+01       0.000000
50%     29217.000000  2.810000e+02       5.000000
75%     46101.000000  1.209000e+03      25.000000
max     78030.000000  1.065309e+06   26466.000000

## Indexing and Selecting Data in Pandas

In [32]:
# using the for loop to return each of the column index and the value

for idx, value in enumerate(data.columns):
    print(idx, value)

0 date
1 county
2 state
3 fips
4 cases
5 deaths

In [27]:
# return date, county columns

data_1 = data.loc[:,'date':'county']
data_1.head()

         date     county
0  2020-01-21  Snohomish
1  2020-01-22  Snohomish
2  2020-01-23  Snohomish
3  2020-01-24       Cook
4  2020-01-24  Snohomish

What's the differences between iloc and loc? If you want to extract the data based on column name, you use loc. In other case where you want to extract the data based on index number then you use iloc.

In [31]:
data[['date','county']].head()

         date     county
0  2020-01-21  Snohomish
1  2020-01-22  Snohomish
2  2020-01-23  Snohomish
3  2020-01-24       Cook
4  2020-01-24  Snohomish

## Selecting Multiple Rangers

In [55]:
# return date, state, cases, death

import numpy as np

data_se = data.iloc[:, np.r_[:1, 2, 4, 5]]
data_se

              date       state  cases  deaths
0       2020-01-21  Washington      1     0.0
1       2020-01-22  Washington      1     0.0
2       2020-01-23  Washington      1     0.0
3       2020-01-24    Illinois      1     0.0
4       2020-01-24  Washington      1     0.0
...            ...         ...    ...     ...
959457  2021-01-23     Wyoming   3384    30.0
959458  2021-01-23     Wyoming   2870     5.0
959459  2021-01-23     Wyoming   1887    12.0
959460  2021-01-23     Wyoming    852    25.0
959461  2021-01-23     Wyoming    609     4.0

[959462 rows x 4 columns]